Repository: typhoonworks/lotus_web
Catalog: priv/gettext/*/LC_MESSAGES/default.po
Languages: fr

source: rows
fr: lignes

source: (or a single %{value} column).
fr: (ou une seule colonne %{value}).

source: Add variables in SQL with %{variable_code}. When you type one, Lotus detects it and adds an input in the toolbar.
fr: Ajoutez des variables dans le SQL avec %{variable_code}. Lorsque vous en saisissez une, Lotus la détecte et ajoute un champ dans la barre d'outils.

source: Are you sure you want to delete this query? This action cannot be undone.
fr: Voulez-vous vraiment supprimer cette requête ? Cette action est irréversible.

source: Browse tables
fr: Explorer les tables

source: Browse the contents of your databases, tables, and columns. Pick a database to get started.
fr: Parcourez le contenu de vos bases, tables et colonnes. Choisissez une base de données pour commencer.

source: Cancel
fr: Annuler

source: Copy query to clipboard
fr: Copier la requête dans le presse-papiers

source: Created
fr: Créée

source: Custom list
fr: Liste personnalisée

source: Data Reference
fr: Référence des données

source: Database
fr: Base de données

source: Default value
fr: Valeur par défaut

source: Delete
fr: Supprimer

source: Delete query
fr: Supprimer la requête

source: Done
fr: Terminé

source: Dropdown
fr: Liste déroulante

source: Dropdown list
fr: Liste déroulante

source: Dropdown values for the %{variable} widget
fr: Valeurs déroulantes pour le widget %{variable}

source: Edit
fr: Modifier

source: Enter SQL to run query
fr: Saisissez du SQL pour exécuter la requête

source: Enter a default value...
fr: Saisissez une valeur par défaut...

source: Enter one value per line. Use "value | label" format to add display labels.
fr: Entrez une valeur par ligne. Utilisez le format "valeur | libellé" pour ajouter un libellé d'affichage.

source: Enter query description (optional)
fr: Entrez la description de la requête (facultatif)

source: Enter query name
fr: Entrez le nom de la requête

source: Enter value
fr: Saisissez une valeur

source: Error
fr: Erreur

source: Expand editor
fr: Agrandir l'éditeur

source: Export (.csv)
fr: Exporter (.csv)

source: Export query results to CSV
fr: Exporter les résultats de la requête en CSV

source: Failed to copy to clipboard!
fr: Échec de la copie dans le presse-papiers !

source: Failed to delete query
fr: Impossible de supprimer la requête

source: Failed to save query
fr: Impossible d'enregistrer la requête

source: From SQL
fr: Depuis le SQL

source: Help
fr: Aide

source: Here's where your results will appear
fr: Vos résultats s'afficheront ici

source: Input
fr: Saisie

source: Input box
fr: Champ de saisie

source: Input label
fr: Libellé du champ

source: Label defaults to title-cased variable name
fr: Le libellé correspond par défaut au nom de variable en casse titre

source: Label for %{name}
fr: Libellé pour %{name}

source: Labels & defaults
fr: Libellés et valeurs par défaut

source: Min Age
fr: Âge min

source: Minimize editor
fr: Réduire l'éditeur

source: Name
fr: Nom

source: New Query
fr: Nouvelle requête

source: Next
fr: Suivant

source: No query results to export
fr: Aucun résultat de requête à exporter

source: No results found
fr: Aucun résultat

source: No saved queries yet.
fr: Aucune requête enregistrée pour le moment.

source: Number
fr: Nombre

source: Please enter a SQL statement
fr: Veuillez saisir une instruction SQL

source: Please enter at least one option
fr: Veuillez saisir au moins une option

source: Please test your SQL query first and ensure it returns results
fr: Veuillez d'abord tester votre requête SQL et vérifier qu'elle renvoie des résultats

source: Prev
fr: Précédent

source: Preview (first 3 results):
fr: Aperçu (3 premiers résultats) :

source: Queries
fr: Requêtes

source: Query copied to clipboard!
fr: Requête copiée dans le presse-papiers !

source: Query deleted successfully
fr: Requête supprimée avec succès

source: Query execution failed
fr: Échec de l'exécution de la requête

source: Query execution failed: %{reason}
fr: Échec de l'exécution de la requête : %{reason}

source: Query not found
fr: Requête introuvable

source: Query running...
fr: Requête en cours...

source: Query saved successfully!
fr: Requête enregistrée avec succès !

source: Results
fr: Résultats

source: Run Query
fr: Exécuter la requête

source: Run query
fr: Exécuter la requête

source: SELECT value_column, label_column FROM table_name -- OR -- SELECT value_column FROM table_name
fr: SELECT value_column, label_column FROM table_name -- OU -- SELECT value_column FROM table_name

source: SQL query
fr: Requête SQL

source: SQL query cannot be empty
fr: La requête SQL ne peut pas être vide

source: Save
fr: Sauvegarder

source: Save Query
fr: Enregistrer la requête

source: Schema
fr: Schéma

source: Schema Header
fr: En-tête du schéma

source: Search
fr: Rechercher

source: Select %{label}
fr: Sélectionner %{label}

source: Select date
fr: Sélectionner une date

source: Select source
fr: Sélectionner une source

source: Select value
fr: Sélectionner une valeur

source: Settings
fr: Paramètres

source: Showing %{from}–%{to}
fr: Affichage de %{from}–%{to}

source: Showing 0
fr: Affichage 0

source: Static options
fr: Options statiques

source: Success
fr: Succès

source: Tables in Schema
fr: Tables du schéma

source: Test Query
fr: Tester la requête

source: Testing...
fr: Test en cours...

source: Text
fr: Texte

source: To run your query, click on the Run button or press
fr: Pour exécuter votre requête, cliquez sur le bouton Exécuter ou appuyez sur

source: Toolbar
fr: Barre d'outils

source: Untitled
fr: Sans titre

source: Using variables
fr: Utiliser des variables

source: Values are always sent as prepared parameters (no string interpolation), using your DB dialect’s placeholders.
fr: Les valeurs sont toujours envoyées comme paramètres préparés (sans interpolation de chaîne), en utilisant les placeholders de votre dialecte de base de données.

source: Variable name
fr: Nom de la variable

source: Variable settings
fr: Paramètres de la variable

source: Variable type
fr: Type de variable

source: Widget type
fr: Type de widget

source: Write a SQL query that returns value and label columns (or just a value column).
fr: Écrivez une requête SQL qui renvoie les colonnes valeur et libellé (ou uniquement une colonne valeur).

source: You don't have permission to delete queries
fr: Vous n'avez pas l'autorisation de supprimer des requêtes

source: You don't have permission to save queries
fr: Vous n'avez pas l'autorisation d'enregistrer des requêtes

source: Your query returned no rows
fr: Votre requête n'a retourné aucune ligne

source: choose one:
fr: choisissez-en une :

source: date picker, ISO date
fr: sélecteur de date, date ISO

source: default
fr: par défaut

source: free text/number entry
fr: saisie libre texte/nombre

source: integers/decimals
fr: entiers/décimaux

source: is used if the toolbar input is empty.
fr: est utilisée si le champ de la barre d'outils est vide.

source: one per line.
fr: une par ligne.

source: plain strings (quoted for you)
fr: chaînes simples (avec guillemets automatiques)

source: return columns as
fr: retournez les colonnes comme

source: of %{count} row
fr: sur %{count} ligne

source: %{count} column
fr: %{count} colonne

source: %{count} row
fr: %{count} ligne

source: %{count} schema
fr: %{count} schéma

source: Close
fr: Fermer

source: General
fr: Général

source: Keyboard Shortcuts
fr: Raccourcis clavier

source: Keyboard shortcuts
fr: Raccourcis clavier

source: Note:
fr: Remarque :

source: Query Editor
fr: Éditeur de requêtes

source: Show keyboard shortcuts
fr: Afficher les raccourcis clavier

source: Toggle Schema Explorer
fr: Afficher/Masquer l'explorateur de schémas

source: Toggle Variable Settings
fr: Afficher/Masquer les paramètres des variables

source: ⌘ is the Command key on Mac
fr: ⌘ correspond à la touche Command sur Mac

source: See details below
fr: Voir les détails ci-dessous

source: Area
fr: Aires

source: Axis Display
fr: Affichage des axes

source: Bar
fr: Barres

source: Change
fr: Modifier

source: Chart
fr: Graphique

source: Chart Type
fr: Type de graphique

source: Chart view
fr: Vue graphique

source: Choose a chart type to visualize your data.
fr: Choisissez un type de graphique pour visualiser vos données.

source: Color/Series Field
fr: Champ couleur/série

source: Configuration incomplete
fr: Configuration incomplète

source: Configure
fr: Configurer

source: Enter label...
fr: Saisir un libellé...

source: Group data by this field using different colors
fr: Grouper les données par ce champ en utilisant différentes couleurs

source: Label
fr: Libellé

source: Line
fr: Ligne

source: None
fr: Aucun

source: Pie
fr: Secteurs

source: Query Results
fr: Résultats de requête

source: Running...
fr: Exécution...

source: Scatter
fr: Nuage de points

source: Select both X-Axis and Y-Axis fields to enable the chart view.
fr: Sélectionnez les champs des axes X et Y pour activer la vue graphique.

source: Select field...
fr: Sélectionner un champ...

source: Show label
fr: Afficher le libellé

source: Switch to chart view
fr: Basculer vers la vue graphique

source: Switch to table view
fr: Basculer vers la vue tableau

source: Table view
fr: Vue tableau

source: The field to use for the horizontal axis
fr: Le champ à utiliser pour l'axe horizontal

source: The field to use for the vertical axis (should be numeric)
fr: Le champ à utiliser pour l'axe vertical (doit être numérique)

source: Toggle visualization settings
fr: Afficher/Masquer les paramètres de visualisation

source: Use the chart icon in the bottom bar to view.
fr: Utilisez l'icône graphique dans la barre inférieure pour afficher.

source: Visualization
fr: Visualisation

source: Visualization configured
fr: Visualisation configurée

source: X-Axis
fr: Axe X

source: X-Axis Field
fr: Champ de l'axe X

source: Y-Axis
fr: Axe Y

source: Y-Axis Field
fr: Champ de l'axe Y

source: optional
fr: optionnel

source: + %{count} more rows
fr: + %{count} lignes supplémentaires

source: Add Card
fr: Ajouter une carte

source: Add Filter
fr: Ajouter un filtre

source: All
fr: Tout

source: Are you sure you want to delete this card?
fr: Voulez-vous vraiment supprimer cette carte ?

source: Are you sure you want to delete this dashboard? This action cannot be undone.
fr: Voulez-vous vraiment supprimer ce tableau de bord ? Cette action est irréversible.

source: Area Chart
fr: Graphique en aires

source: Auto-refresh
fr: Actualisation automatique

source: Automatically refresh all cards at this interval.
fr: Actualiser automatiquement toutes les cartes à cet intervalle.

source: Bar Chart
fr: Graphique en barres

source: Card
fr: Carte

source: Card Settings
fr: Paramètres de la carte

source: Card Title
fr: Titre de la carte

source: Cards
fr: Cartes

source: Choose a query...
fr: Choisir une requête...

source: Content
fr: Contenu

source: Copy URL
fr: Copier l'URL

source: Create a public link to share this dashboard with anyone. They won't need to log in.
fr: Créer un lien public pour partager ce tableau de bord avec n'importe qui. Aucune connexion requise.

source: Create your first dashboard
fr: Créer votre premier tableau de bord

source: Create your first query
fr: Créer votre première requête

source: Danger Zone
fr: Zone dangereuse

source: Dashboard
fr: Tableau de bord

source: Dashboard Not Found
fr: Tableau de bord introuvable

source: Dashboard Settings
fr: Paramètres du tableau de bord

source: Dashboard deleted successfully
fr: Tableau de bord supprimé avec succès

source: Dashboard not found
fr: Tableau de bord introuvable

source: Dashboard not found or no longer public
fr: Tableau de bord introuvable ou n'est plus public

source: Dashboard saved successfully!
fr: Tableau de bord enregistré avec succès !

source: Dashboard settings
fr: Paramètres du tableau de bord

source: Dashboards
fr: Tableaux de bord

source: Delete Card
fr: Supprimer la carte

source: Delete Dashboard
fr: Supprimer le tableau de bord

source: Disable Sharing
fr: Désactiver le partage

source: Disabled
fr: Désactivé

source: Display query results as table or chart
fr: Afficher les résultats sous forme de tableau ou graphique

source: Enable Public Link
fr: Activer le lien public

source: Enter dashboard description (optional)
fr: Entrez la description du tableau de bord (facultatif)

source: Enter dashboard name
fr: Entrez le nom du tableau de bord

source: Enter heading text...
fr: Entrez le texte du titre...

source: Enter text or markdown content...
fr: Entrez du texte ou du contenu markdown...

source: External link
fr: Lien externe

source: Failed to delete dashboard
fr: Impossible de supprimer le tableau de bord

source: Failed to save dashboard
fr: Impossible d'enregistrer le tableau de bord

source: Filter Mappings
fr: Mappages de filtres

source: Grid uses 12 columns. Cards are positioned by column (X) and row (Y).
fr: La grille utilise 12 colonnes. Les cartes sont positionnées par colonne (X) et ligne (Y).

source: Heading
fr: Titre

source: Heading Text
fr: Texte du titre

source: Layout Position
fr: Position dans la grille

source: Line Chart
fr: Graphique linéaire

source: Link
fr: Lien

source: Link URL
fr: URL du lien

source: Markdown text content
fr: Contenu texte markdown

source: New
fr: Nouveau

source: New Dashboard
fr: Nouveau tableau de bord

source: No dashboard filters configured.
fr: Aucun filtre de tableau de bord configuré.

source: No dashboards yet.
fr: Aucun tableau de bord pour le moment.

source: No data
fr: Aucune donnée

source: No link set
fr: Aucun lien défini

source: Not mapped
fr: Non mappé

source: Pie Chart
fr: Graphique en secteurs

source: Powered by
fr: Propulsé par

source: Public Sharing
fr: Partage public

source: Public link enabled
fr: Lien public activé

source: Query
fr: Requête

source: Query timeout
fr: Délai d'expiration de la requête

source: Refresh
fr: Actualiser

source: Refresh all cards
fr: Actualiser toutes les cartes

source: SQL Query
fr: Requête SQL

source: Save Dashboard
fr: Enregistrer le tableau de bord

source: Scatter Plot
fr: Nuage de points

source: Section heading
fr: Titre de section

source: Select Query
fr: Sélectionner une requête

source: Table (default)
fr: Tableau (par défaut)

source: Text Content
fr: Contenu texte

source: This dashboard has no cards.
fr: Ce tableau de bord n'a pas de cartes.

source: Update Dashboard
fr: Mettre à jour le tableau de bord

source: Width (1-12)
fr: Largeur (1-12)

source: Y Position
fr: Position Y

source: You don't have permission to delete dashboards
fr: Vous n'avez pas l'autorisation de supprimer des tableaux de bord

source: You don't have permission to save dashboards
fr: Vous n'avez pas l'autorisation d'enregistrer des tableaux de bord

source: hour
fr: heure

source: Failed to disable sharing
fr: Impossible de désactiver le partage

source: Failed to enable sharing
fr: Impossible d'activer le partage

source: Height
fr: Hauteur

source: Public sharing disabled
fr: Partage public désactivé

source: Public sharing enabled
fr: Partage public activé

source: Save the dashboard first to enable public sharing.
fr: Enregistrez d'abord le tableau de bord pour activer le partage public.

source: You don't have permission to modify dashboards
fr: Vous n'avez pas l'autorisation de modifier des tableaux de bord

source: AI Assistant
fr: Assistant IA

source: AI features are not configured
fr: Les fonctionnalités IA ne sont pas configurées

source: AI features are not configured. Please add AI configuration.
fr: Les fonctionnalités IA ne sont pas configurées. Veuillez ajouter la configuration IA.

source: AI query generated successfully
fr: Requête IA générée avec succès

source: API key is missing or invalid
fr: La clé API est manquante ou invalide

source: Describe your query in plain English
fr: Décrivez votre requête en langage naturel

source: Example: Show all active users who signed up in the last 30 days
fr: Exemple : Afficher tous les utilisateurs actifs inscrits au cours des 30 derniers jours

source: Failed to generate query: %{error}
fr: Échec de la génération de la requête : %{error}

source: Generate Query
fr: Générer la requête

source: Generate query with AI
fr: Générer la requête avec l'IA

source: Generating query...
fr: Génération de la requête...

source: Generating...
fr: Génération...

source: Please select a data source first
fr: Veuillez d'abord sélectionner une source de données

source: Query generation timed out or crashed
fr: La génération de la requête a expiré ou s'est interrompue

source: Unable to generate query
fr: Impossible de générer la requête

source: What would you like to query?
fr: Que souhaitez-vous interroger ?

source: Toggle AI Assistant
fr: Activer/désactiver l'assistant IA
